classes/subclasses/actor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 17:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Actor</title>
<meta name="author" content="zfoteff" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../static/stylesheets/subclass-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Actor</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0c6ebcf">1. Level 1:</a></li>
<li><a href="#orgc4cfb74">2. Level 2:</a></li>
<li><a href="#org0b3d551">3. Level 5:</a></li>
<li><a href="#orga1d6df0">4. Level 10:</a></li>
<li><a href="#org617c94c">5. Level 15:</a></li>
<li><a href="#org32367b9">6. Level 19:</a></li>
</ul>
</div>
</div>
<hr />
<div id="outline-container-org0c6ebcf" class="outline-2">
<h2 id="org0c6ebcf"><span class="section-number-2">1.</span> Level 1:</h2>
<div class="outline-text-2" id="text-1">
<p>
You are famous. This makes you somewhat recognizable. NPC attitudes may vary towards you, and many will have a first impression of you. You are more likely to be recognized in more populated parts of the world.
</p>
</div>
</div>
<div id="outline-container-orgc4cfb74" class="outline-2">
<h2 id="orgc4cfb74"><span class="section-number-2">2.</span> Level 2:</h2>
<div class="outline-text-2" id="text-2">
<p>
Obtain an eternal, irrevocable, and unchangeable cultural side-quest from the Cultural Side-Quest Generator. Completion of the side-quest may result in additional awards, and will 1 result in the player being rewarded another cultural side-quest.
</p>
</div>
</div>
<div id="outline-container-org0b3d551" class="outline-2">
<h2 id="org0b3d551"><span class="section-number-2">3.</span> Level 5:</h2>
<div class="outline-text-2" id="text-3">
<p>
Gain <span class="underline">Attraction</span>: This trait places low Wisdom <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> characters under the spell of your magnificent good looks twice per long rest. This can only effect <b>1 target at a time</b>. While attracted to you, this target is distracted from the actions of the rest of the party for three turns, but it <b>EXTREMELY</b> aware of your actions. They will not attack you unless put in extreme circumstances <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>

<p>
Gain <span class="underline">Perfect Memory</span>: Anything the DM has said to you before, the actor will remember perfectly twice per long request. The player has to consult the DM to determine what exact detail is to be remembered by the actor in exploration. The player has -5 to hit on memory related spells in combat.
</p>
</div>
</div>
<div id="outline-container-orga1d6df0" class="outline-2">
<h2 id="orga1d6df0"><span class="section-number-2">4.</span> Level 10:</h2>
<div class="outline-text-2" id="text-4">
<p>
Gain <span class="underline">Spectral Manager</span>: The manager will keep you informed of any important cultural and political requests upon request. It may also send you concert invites, and give you a hookup for drugs.
</p>

<p>
Gain <span class="underline">Booking Agent</span>: Once per long rest, you many travel to any part of the world in a single day, and the agent will arrange travel free of cost.
</p>
</div>
</div>
<div id="outline-container-org617c94c" class="outline-2">
<h2 id="org617c94c"><span class="section-number-2">5.</span> Level 15:</h2>
<div class="outline-text-2" id="text-5">
<p>
You can now perform a perfect impersonation of anyone, as long as that person themselves does not observe you. Targets will be convinced you are the other person and treat you as such.
</p>

<p>
You gain a <span class="underline">Costume Kit</span>: Within reason, you can make the party appear as other characters in the game. The DM will impose some situation limits on what the party can impersonate.
</p>
</div>
</div>
<div id="outline-container-org32367b9" class="outline-2">
<h2 id="org32367b9"><span class="section-number-2">6.</span> Level 19:</h2>
<div class="outline-text-2" id="text-6">
<p>
Gain knowledge of the <span class="underline"><b>The Forgotten Act</b></span>: Upon performing the Forgotten Act in its entirety, one of the Old Gods will descend upon you to initiate an end-game level encounter. This will result in significant rewards for the actor, and potentially other players in the party.
</p>
<hr />
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Glossary: <a href="../../glossary.html#ID-a3719559-2b06-443a-b75a-96c9aa3f3b26">Wisdom</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Extreme circumstances are determined at the discretion of the DM
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-12 Wed 00:00</p>
<p class="author">Author: zfoteff</p>
<p class="date">Created: 2023-07-12 Wed 17:22</p>
</div>
</body>
</html>
